{
    "author": "",
    "description_translations": {
        "en": "Specific co-production process specially catered for co-refinement of previously created solution (app, tool or service). It consists of two phases co-reflection and re-design. Hence, an initial phase (co-reflection) is executed where after an initial retrospective analysis of what is available, new most desirable features are specified, voted, and selected. Then, a second phase (re-design) is launched to accommodate the most highly rated features. After an initial planning about future co-design workshops, new tasks are launched to focus on the collaborative re-design of some core thematic areas of the app, tool or service to refine.",
		"es": "Proceso específico de coproducción especialmente pensado para la co-refinación de una herramienta o aplicación creada previamente. Consta de dos fases: la de co-reflexión y la de re-diseño. Así, se ejecuta una primera fase (co-reflexión) en la que, tras un primer análisis retrospectivo de lo disponible, se especifican, votan y seleccionan las nuevas características más deseables. A continuación, se pone en marcha una segunda fase (rediseño) para dar cabida a las características más valoradas. Tras una planificación inicial sobre futuros talleres de codiseño, se lanzan nuevas tareas para centrarse en el rediseño colaborativo de algunas áreas temáticas centrales de la aplicación, herramienta o servicio para perfeccionarlas.",
        "it": "Processo di co-produzione specifico per il perfezionamento di uno strumento o di un'applicazione precedentemente creati. Si compone di due fasi: la co-riflessione e la riprogettazione. Si procede quindi a una prima fase (co-riflessione) in cui, dopo un'analisi retrospettiva iniziale di ciò che è disponibile, vengono specificate, votate e selezionate le nuove caratteristiche più desiderabili. Successivamente, viene avviata una seconda fase (riprogettazione) per accogliere le caratteristiche più votate. Dopo una pianificazione iniziale sui futuri workshop di co-progettazione, vengono avviati nuovi compiti per concentrarsi sulla riprogettazione collaborativa di alcune aree tematiche centrali dell'app, dello strumento o del servizio da perfezionare.",
        "lv": "Īpašs kopražošanas process, kas īpaši pielāgots iepriekš radīta rīka vai lietotnes pilnveidošanai. Tas sastāv no diviem posmiem - koprefleksijas un pārprojektēšanas. Tādējādi tiek veikta sākotnējā fāze (koprefleksija), kurā pēc sākotnējās pieejamo iespēju retrospektīvās analīzes tiek precizētas, nobalsotas un izvēlētas jaunas vēlamākās funkcijas. Pēc tam tiek uzsākta otrā fāze (pārprojektēšana), lai pielāgotu visaugstāk novērtētās funkcijas. Pēc sākotnējās plānošanas par turpmākajiem kopprojektēšanas semināriem tiek uzsākti jauni uzdevumi, lai koncentrētos uz dažu galveno tematisko jomu kopīgu pārprojektēšanu, lai pilnveidotu lietojumprogrammu, rīku vai pakalpojumu."
    },
    "environments": [
        "varam",
        "mef",
        "zgz"
    ],
    "id": "solutioncorefinementprocess",
    "languages": [
        "en",
        "es",
        "it",
        "lv"
    ],
    "licence": "permissive",
    "name_translations": {
        "en": "Co-refinement schema to support co-refection and collaborative re-design of an existing solution (app, tool or service)",
        "es": "Esquema de co-refinamiento para apoyar la co-refección y el re-diseño colaborativo de una aplicación, herramienta o servicio existente",
        "it": "Schema di co-refinizione per supportare la co-refezione e la riprogettazione collaborativa di un'applicazione, uno strumento o un servizio esistente",
        "lv": "Līdzpilnveidošanas shēma, lai atbalstītu esošas lietotnes, rīka vai pakalpojuma līdzpilnveidošanu un kopīgu pārprojektēšanu."
    },
    "tags_translations": {
        "en": [
            "solution co-refinement process",
            "coproduction"
        ]
    }
}
