{
    "id": "phase-coreflectionofsolution",
    "prerequisites": [],
    "name_translations": {
        "en": "Co-reflection of solution",
        "es": "Correflexión sobre la solución",
        "it": "Co-riflessione della soluzione",
        "lv": "Risinājuma līdzatspoguļošana"
    },
    "description_translations": {
        "en": "During this phase, two objectives are addressed. Firstly, a collaborative retrospective analysis of the current existing solution is performed, where status, outcomes, and reflections about positive and negative aspects of the current released are reviewed. To accomplish this objective, presentations and reflection documents may be performed. Secondly, a collaborative reflection about possible new desirable features for the solution is performed. To meet this objective, polls on possible new features and guiding discussions may be performed. ",
        "es": "Durante esta fase, se abordan dos objetivos. En primer lugar, se realiza un análisis retrospectivo colaborativo de la solución actual existente, en el que se revisa el estado, los resultados y las reflexiones sobre los aspectos positivos y negativos de la actual liberada. Para lograr este objetivo, se pueden realizar presentaciones y documentos de reflexión. En segundo lugar, se realiza una reflexión colaborativa sobre posibles nuevas características deseables para la solución. Para cumplir este objetivo, se pueden realizar encuestas sobre posibles nuevas características y debates orientativos. ",
        "it": "In questa fase si affrontano due obiettivi. In primo luogo, viene eseguita un'analisi retrospettiva collaborativa dell'attuale soluzione esistente, in cui vengono esaminati lo stato, i risultati e le riflessioni sugli aspetti positivi e negativi dell'attuale rilascio. Per raggiungere questo obiettivo, si possono realizzare presentazioni e documenti di riflessione. In secondo luogo, viene effettuata una riflessione collaborativa sulle possibili nuove caratteristiche desiderabili per la soluzione. Per raggiungere questo obiettivo, si possono effettuare sondaggi su possibili nuove funzionalità e discussioni guida. ",
        "lv": "Šajā posmā tiek risināti divi mērķi. Pirmkārt, tiek veikta pašreizējā esošā risinājuma retrospektīva analīze, kurā tiek pārskatīts pašreizējā atbrīvotā risinājuma stāvoklis, rezultāti un pārdomas par pozitīvajiem un negatīvajiem aspektiem. Lai sasniegtu šo mērķi, var tikt veiktas prezentācijas un atspoguļojuma dokumenti. Otrkārt, tiek veiktas kopīgas pārdomas par iespējamām jaunām vēlamām risinājuma iezīmēm. Lai sasniegtu šo mērķi, var veikt aptaujas par iespējamām jaunām funkcijām un vadīt diskusijas. "
    },
    "objectives": [
        {
            "name_translations": {
                "en": "Co-analyse retrospectively solution",
                "es": "Co-analizar la solución retrospectivamente",
                "it": "Co-analizzare la soluzione in modo retrospettivo ",
                "lv": "Risinājuma retrospektīva līdzanalīze"
            },
            "description_translations": {
                "en": "The understanding of the work done until that moment for a given solution and a reflection of what has been done right, what could be done and what should be done better or in another way is critical to continuously enhance an existing solution.",
                "es": "La comprensión del trabajo realizado hasta ese momento para una determinada solución y la reflexión sobre lo que se ha hecho bien, lo que podría hacerse y lo que debería hacerse mejor o de otra manera es fundamental para mejorar continuamente una solución existente. ",
                "it": "La comprensione del lavoro svolto fino a quel momento per una determinata soluzione e la riflessione su ciò che è stato fatto bene, su ciò che potrebbe essere fatto e su ciò che dovrebbe essere fatto meglio o in un altro modo è fondamentale per migliorare continuamente una soluzione esistente. ",
                "lv": "Izpratne par līdz šim paveikto darbu saistībā ar konkrēto risinājumu un pārdomas par to, kas ir izdarīts pareizi, ko varētu darīt un ko vajadzētu darīt labāk vai citādi, ir ļoti svarīga, lai nepārtraukti uzlabotu esošo risinājumu."
            },
            "problemprofiles": [],
            "tasks": [
                {
                    "name_translations": {
                        "en": "Summarize current solution features",
                        "es": "Entender los diferentes tipos de stakeholders y sus motivaciones",
                        "it": "Comprendi le diverse tipologie di attori da coinvolgere",
                        "lv": "Izpratne par dažādiem ieinteresēto personu veidiem"
                    },
                    "description_translations": {
                        "en": "Retrospective explanation of current features of solution under analysis subject to re-design. ",
                        "es": "Explicación retrospectiva de las características actuales de la solución analizada sujeta a rediseño. ",
                        "it": "Spiegazione retrospettiva delle caratteristiche attuali della soluzione in analisi soggetta a riprogettazione. ",
                        "lv": "Analizējamā risinājuma pašreizējo iezīmju retrospektīvs skaidrojums, kas pakļauts pārprojektēšanai."
                    },
                    "problemprofiles": [
                        "ORG_PROBLEM_10"
                    ],
                    "prerequisites": [],
                    "id": "task-summarize_current_solution_features"
                },
                {
                    "name_translations": {
                        "en": "Summarize evaluation results of current solution",
                        "es": "Resumir los resultados de la evaluación de la solución actual",
                        "it": "Riassumere i risultati della valutazione della soluzione attuale",
                        "lv": "Apkopot pašreizējā risinājuma novērtēšanas rezultātus"
                    },
                    "description_translations": {
                        "en": "Retrospective explanation of the evaluation results carried out over the solution under analysis ",
                        "es": "Explicación retrospectiva de los resultados de la evaluación realizada sobre la solución analizada ",
                        "it": "Spiegazione retrospettiva dei risultati della valutazione effettuata sulla soluzione in analisi ",
                        "lv": "Analizējamā risinājuma novērtēšanas rezultātu retrospektīvs skaidrojums"
                    },
                    "problemprofiles": [
                        "ORG_PROBLEM_10"
                    ],
                    "prerequisites": [
                        {
                            "item": "task-summarize_current_solution_features",
                            "type": "previous"
                        }
                    ],
                    "id": "task-summarize_evaluation_results_of_current_solution"
                },
                {
                    "name_translations": {
                        "en": "Review based on reflections from evaluators",
                        "es": "Revisión basada en las reflexiones de los evaluadores",
                        "it": "Revisione basata sulle riflessioni dei valutatori",
                        "lv": "Pārskats, pamatojoties uz vērtētāju pārdomām"
                    },
                    "description_translations": {
                        "en": "Synthesis on the new features that should be added to the current solution to improve it in a following release or update.",
                        "es": "Síntesis sobre las nuevas características que deberían añadirse a la solución actual para mejorarla en una siguiente versión o actualización",
                        "it": "Sintesi delle nuove funzionalità che dovrebbero essere aggiunte alla soluzione attuale per migliorarla in una release o in un aggiornamento successivo.",
                        "lv": "Sintēze par jaunām funkcijām, kas jāpievieno pašreizējam risinājumam, lai to uzlabotu nākamajā versijā vai atjauninājumā."
                    },
                    "problemprofiles": [
                        "ORG_PROBLEM_10"
                    ],
                    "prerequisites": [
                        {
                            "item": "task-summarize_evaluation_results_of_current_solution",
                            "type": "previous"
                        }
                    ],
                    "id": "task-review_based_on_reflections_from_evaluators"
                }
            ],
            "id": "objective-co_analyse_retrospectively_solution",
            "prerequisites": []
        },
        {
            "name_translations": {
                "en": "Co-reflect on new features for solution",
                "es": "Co-responder a las nuevas características de la solución",
                "it": "Riflettere insieme sulle nuove caratteristiche della soluzione",
                "lv": "Kopīga pārdomu veikšana par jaunām risinājuma funkcijām"
            },
            "description_translations": {
                "en": "During this phase, several objectives are addressed voting the preferred existing features, voting the most desirable new features or revisions of existing ones and discussing over different aspects to make the solution more acceptable and sustainable, namely, co-delivery aspects, quality of the resulting co-produced solution or discussion on possible new most needed enhancements. ",
                "es": "Durante esta fase, se abordan varios objetivos: votar las características existentes preferidas, votar las nuevas características más deseables o las revisiones de las existentes y debatir sobre diferentes aspectos para que la solución sea más aceptable y sostenible, a saber, los aspectos de la coproducción, la calidad de la solución coproducida resultante o el debate sobre las posibles mejoras nuevas más necesarias. ",
                "it": "Durante questa fase, vengono affrontati diversi obiettivi: votare le caratteristiche esistenti preferite, votare le nuove caratteristiche più desiderabili o le revisioni di quelle esistenti e discutere su diversi aspetti per rendere la soluzione più accettabile e sostenibile, ovvero gli aspetti di co-delivery, la qualità della soluzione co-prodotta risultante o la discussione sui possibili nuovi miglioramenti più necessari. ",
                "lv": "Šajā fāzē tiek risināti vairāki uzdevumi, balsojot par vēlamajām esošajām funkcijām, balsojot par vēlamākajām jaunajām funkcijām vai esošo funkciju pārskatīšanu un apspriežot dažādus aspektus, lai risinājumu padarītu pieņemamāku un ilgtspējīgāku, proti, kopīgas piegādes aspektus, kopīgi izstrādātā risinājuma kvalitāti vai diskusiju par iespējamiem jauniem, visvairāk nepieciešamajiem uzlabojumiem. "
            },
            "problemprofiles": [
                "ORG_PROBLEM_11",
                "VAL_PROBLEM_2",
                "UND_PROBLEM_1"
            ],
            "tasks": [
                {
                    "name_translations": {
                        "en": "Voting and discussing current functionalities",
                        "es": "Votación y debate de las funcionalidades actuales",
                        "it": "Votare e discutere le funzionalità attuali",
                        "lv": "Balsošana un pašreizējo funkcionalitāšu apspriešana"
                    },
                    "description_translations": {
                        "en": "Discuss and prioritize through voting what features are considered most useful.",
                        "es": "Discutir y priorizar mediante votación qué características se consideran más útiles.",
                        "it": "Discutere e stabilire le priorità attraverso la votazione delle caratteristiche ritenute più utili.",
                        "lv": "Apspriediet un, balsojot, nosakiet prioritātes, kuras funkcijas tiek uzskatītas par visnoderīgākajām."
                    },
                    "problemprofiles": [
                        "ORG_PROBLEM_11",
                        "VAL_PROBLEM_2",
                        "UND_PROBLEM_1"
                    ],
                    "id": "task-voting_and_discussing_current_functionalities",
                    "prerequisites": []
                },
                {
                    "name_translations": {
                        "en": "Voting and discussing potential new functionalities or revisions of existing ones",
                        "es": "Votar y debatir posibles nuevas funcionalidades o revisiones de las existentes",
                        "it": "Votare e discutere potenziali nuove funzionalità o revisioni di quelle esistenti",
                        "lv": "Balsošana un diskusija par iespējamām jaunām funkcijām vai esošo funkciju pārskatīšanu."
                    },
                    "description_translations": {
                        "en": "Discuss and prioritize through voting what new features or current features’ enhancements should be considered most useful.",
                        "es": "Discutir y priorizar a través de la votación qué nuevas características o mejoras de las características actuales deben considerarse más útiles.",
                        "it": "Discutere e stabilire le priorità attraverso la votazione delle nuove funzionalità o dei miglioramenti delle funzionalità attuali da considerare più utili.",
                        "lv": "Apspriediet un, balsojot, nosakiet prioritātes, kuras jaunas funkcijas vai pašreizējo funkciju uzlabojumi būtu uzskatāmi par visnoderīgākajiem."
                    },
                    "problemprofiles": [
                        "ORG_PROBLEM_11",
                        "VAL_PROBLEM_2",
                        "UND_PROBLEM_1"
                    ],
                    "prerequisites": [
                        {
                            "item": "task-voting_and_discussing_current_functionalities",
                            "type": "previous"
                        }
                    ],
                    "id": "task-voting_and_discussing_potential_new_functionalities_or_revisions_of_existing_ones"
                },
                {
                    "name_translations": {
                        "en": "Guided discussion on co-delivery aspects (Incentives and Rewards)",
                        "es": "Debate guiado sobre los aspectos de la coproducción (incentivos y recompensas)",
                        "it": "Discussione guidata sugli aspetti di co-delivery (Incentivi e ricompense)",
                        "lv": "Vadīta diskusija par kopīgas piegādes aspektiem (stimuli un atlīdzība)"
                    },
                    "description_translations": {
                        "en": "Guide discussion on aspects that could help the solution to be sustainable. For example, analyse what role incentives and rewards may play on making solution co-delivery feasible and viable. ",
                        "es": "Orientar el debate sobre los aspectos que podrían ayudar a que la solución sea sostenible. Por ejemplo, analice qué papel pueden desempeñar los incentivos y las recompensas para que la codistribución de la solución sea factible y viable.",
                        "it": "Guidare la discussione sugli aspetti che potrebbero aiutare la soluzione a essere sostenibile. Ad esempio, analizzate il ruolo che gli incentivi e le ricompense possono avere nel rendere fattibile e praticabile la co-delivery della soluzione. ",
                        "lv": "Vadīt diskusiju par aspektiem, kas varētu palīdzēt risinājumam būt ilgtspējīgam. Piemēram, analizējiet, kāda nozīme varētu būt stimuliem un atlīdzībai, lai risinājumu kopīga piegāde būtu iespējama un dzīvotspējīga."
                    },
                    "problemprofiles": [
                        "ORG_PROBLEM_11",
                        "VAL_PROBLEM_2",
                        "UND_PROBLEM_1"
                    ],
                    "prerequisites": [
                        {
                            "item": "task-voting_and_discussing_potential_new_functionalities_or_revisions_of_existing_ones",
                            "type": "previous"
                        }
                    ],
                    "id": "task-guided_discussion_on_co_delivery_aspects_incentives_and_rewards"
                },
                {
                    "name_translations": {
                        "en": "Guided discussion on quality of co-production (satisfaction, trust, acceptance)",
                        "es": "Debate guiado sobre la calidad de la coproducción (satisfacción, confianza, aceptación)",
                        "it": "Discussione guidata sulla qualità della co-produzione (soddisfazione, fiducia, accettazione)",
                        "lv": "Vadīta diskusija par kopražošanas kvalitāti (apmierinātība, uzticēšanās, pieņemšana)"
                    },
                    "description_translations": {
                        "en": "Guided discussion on how to enhance the quality of the co-produced solution in terms of satisfaction, trust, acceptance … so that its adoption may be wider.",
                        "es": "Debate guiado sobre cómo mejorar la calidad de la solución coproducida en términos de satisfacción, confianza, aceptación... para que su adopción sea más amplia. ",
                        "it": "Discussione guidata su come migliorare la qualità della soluzione co-prodotta in termini di soddisfazione, fiducia, accettazione... in modo che la sua adozione possa essere più ampia.",
                        "lv": "Vadīta diskusija par to, kā uzlabot kopīgi radītā risinājuma kvalitāti attiecībā uz apmierinātību, uzticēšanos, pieņemšanu..., lai tā pieņemšana būtu plašāka."
                    },
                    "problemprofiles": [
                        "ORG_PROBLEM_10",
                        "ORG_PROBLEM_11"
                    ],
                    "prerequisites": [
                        {
                            "item": "task-guided_discussion_on_co_delivery_aspects_incentives_and_rewards",
                            "type": "previous"
                        }
                    ],
                    "id": "task-guided_discussion_on_quality_of_co_production_satisfaction_trust_acceptance"
                },
                {
                    "name_translations": {
                        "en": "Guided discussion on other extensions to solution",
                        "es": "Debate guiado sobre otras extensiones de la solución",
                        "it": "Discussione guidata su altre estensioni della soluzione",
                        "lv": "Vadīta diskusija par citiem risinājuma paplašinājumiem"
                    },
                    "description_translations": {
                        "en": "Guided discussion on what other extensions and new features should be added to the current solution. ",
                        "es": "Debate guiado sobre qué otras extensiones y nuevas funciones deberían añadirse a la solución actual.",
                        "it": "Discussione guidata su quali altre estensioni e nuove funzionalità dovrebbero essere aggiunte alla soluzione attuale. ",
                        "lv": "Vadīta diskusija par to, kādi citi paplašinājumi un jaunas funkcijas būtu jāpievieno pašreizējam risinājumam. "
                    },
                    "problemprofiles": [
                        "ORG_PROBLEM_10",
                        "ORG_PROBLEM_11"
                    ],
                    "prerequisites": [
                        {
                            "item": "task-guided_discussion_on_quality_of_co_production_satisfaction_trust_acceptance",
                            "type": "previous"
                        }
                    ],
                    "id": "task-guided_discussion_on_other_extensions_to_solution"
                }
            ],
            "prerequisites": [
                {
                    "item": "objective-co_analyse_retrospectively_solution",
                    "type": "previous"
                }
            ],
            "id": "objective-co_reflect_on_new_features_for_solution"
        }
    ],
    "is_part_of_codelivery": true
}