{
    "id": "phase-re-design-of-solution",
    "prerequisites": [
        {
            "item": "phase-co-reflection-of-solution",
            "status": "finished"
        }
    ],
    "name_translations": {
        "en": "Re-design of solution",
        "es": "Rediseño de la solución",
        "it": "Riprogettazione della soluzione",
        "lv": "Risinājuma pārprojektēšana"
    },
    "description_translations": {
        "en": "During this phase, two objectives are addressed. Firstly, future co-design actions must be decided and planned. Secondly, the co-design of the existing solution is launched based on the co-decided new features or extensions.",
        "es": "Durante esta fase, se abordan dos objetivos. En primer lugar, hay que decidir y planificar las futuras acciones de codiseño. En segundo lugar, se pone en marcha el codiseño de la solución existente sobre la base de las nuevas características o ampliaciones decididas conjuntamente.",
        "it": "In questa fase si affrontano due obiettivi. In primo luogo, devono essere decise e pianificate le future azioni di co-progettazione. In secondo luogo, si avvia la co-progettazione della soluzione esistente sulla base delle nuove funzionalità o estensioni decise in comune. ",
        "lv": "Šajā posmā tiek risināti divi mērķi. Pirmkārt, jāizlemj un jāplāno turpmākās kopprojektēšanas darbības. Otrkārt, tiek uzsākta esošā risinājuma kopprojektēšana, pamatojoties uz kopīgi pieņemtajiem jaunajiem elementiem vai paplašinājumiem. "
    },
    "objectives": [
        {
            "name_translations": {
                "en": "Co-decide future co-design actions",
                "es": "Decidir las futuras acciones de codiseño",
                "it": "Decidere le future azioni di co-progettazioneDecidere le future azioni di co-progettazione",
                "lv": "Kopīgi lemt par turpmākajām kopprojektēšanas darbībām"
            },
            "description_translations": {
                "en": "This objective seeks the selection and planning of the most important co-design actions for the new release of the solution. ",
                "es": "Este objetivo busca la selección y planificación de las acciones de codiseño más importantes para la nueva versión de la solución. ",
                "it": "Questo obiettivo mira a selezionare e pianificare le azioni di co-progettazione più importanti per la nuova versione della soluzione. ",
                "lv": "Šis mērķis ir vērsts uz svarīgāko kopprojektēšanas darbību atlasi un plānošanu jaunajai risinājuma versijai. "
            },
            "problemprofiles": [
                "ORG_PROBLEM_2",
                "DEF_PROBLEM_3"
            ],
            "tasks": [
                {
                    "name_translations": {
                        "en": "Planning of future co-design thematic workshops",
                        "es": "Planificación de futuros talleres temáticos de codiseño",
                        "it": "Pianificazione di futuri workshop tematici di co-progettazione",
                        "lv": "Turpmāko kopprojektēšanas tematisko semināru plānošana"
                    },
                    "description_translations": {
                        "en": "Set the priorities and plan a set of workshops where new features and extensions of the product are discussed. ",
                        "es": "Establezca las prioridades y planifique una serie de talleres en los que se discutan las nuevas características y extensiones del producto.Establezca las prioridades y planifique una serie de talleres en los que se discutan las nuevas características y extensiones del producto.",
                        "it": "Stabilite le priorità e pianificate una serie di workshop in cui si discutono le nuove funzionalità e le estensioni del prodotto.",
                        "lv": "Noteikt prioritātes un plānot darbsemināru kopumu, kurā tiek apspriestas jaunas produkta funkcijas un paplašinājumi. "
                    },
                    "problemprofiles": [],
                    "prerequisites": [],
                    "id": "task-planning-of-future-co-design-thematic-workshops"
                }
            ],
            "id": "objective-co-decide-future-co-design-actions",
            "prerequisites": []
        },
        {
            "name_translations": {
                "en": "Repeat co-design process based on features co-decided",
                "es": "Repetir el proceso de codiseño basándose en las características decididas conjuntamente",
                "it": "Ripetere il processo di co-progettazione sulla base delle caratteristiche decise in precedenza.",
                "lv": "Atkārtot kopprojektēšanas procesu, pamatojoties uz kopīgi pieņemtajiem elementiem."
            },
            "description_translations": {
                "en": "It encompasses a set of tasks needed to apply a new co-design to a solution in order to add or enhance its existing features.",
                "es": "Abarca un conjunto de tareas necesarias para aplicar un nuevo codiseño a una solución con el fin de añadir o mejorar sus características existentes.",
                "it": "Comprende un insieme di attività necessarie per applicare una nuova co-progettazione a una soluzione, al fine di aggiungere o migliorare le caratteristiche esistenti.",
                "lv": "Tas ietver uzdevumu kopumu, kas nepieciešams, lai risinājumam piemērotu jaunu kopprojektu, lai papildinātu vai uzlabotu tā esošās funkcijas."
            },
            "problemprofiles": [
                "DEF_PROBLEM_3"
            ],
            "tasks": [
                {
                    "name_translations": {
                        "en": "Collaborative re-design of solution functionalities",
                        "es": "Rediseño colaborativo de las funcionalidades de la solución",
                        "it": "Riprogettazione collaborativa delle funzionalità della soluzione",
                        "lv": "Risinājuma funkcionalitāšu kopīga pārprojektēšana"
                    },
                    "description_translations": {
                        "en": "Tackle the specification and design of those new or enhanced features for a given solution.",
                        "es": "Abordar la especificación y el diseño de esas funciones nuevas o mejoradas para una solución determinada.",
                        "it": "Affrontare le specifiche e la progettazione di queste caratteristiche nuove o migliorate per una determinata soluzione.",
                        "lv": "Veiciet šo jauno vai uzlaboto funkciju specifikāciju un izstrādi konkrētajam risinājumam."
                    },
                    "problemprofiles": [
                        "DEF_PROBLEM_3"
                    ],
                    "prerequisites": [],
                    "id": "task-collaborative-re-design-of-solution-functionalities"
                },
                {
                    "name_translations": {
                        "en": "Co-design of co-delivery mechanisms (incentives)",
                        "es": "Co-diseño de mecanismos de co-entrega (incentivos)",
                        "it": "Co-progettazione di meccanismi di co-delivery (incentivi)",
                        "lv": "Kopīgas piegādes mehānismu (stimulu) kopīga izstrāde."
                    },
                    "description_translations": {
                        "en": "Tackle the specification and design of co-delivery related features for the solution, e.g. incentives mechanism or business plan.",
                        "es": "Abordar la especificación y el diseño de las características relacionadas con la coproducción para la solución, por ejemplo, el mecanismo de incentivos o el plan de negocio.  ",
                        "it": "Affrontare le specifiche e la progettazione delle caratteristiche relative alla co-delivery per la soluzione, ad esempio il meccanismo di incentivi o il piano aziendale.",
                        "lv": "Risināt ar koppiegādi saistīto risinājuma elementu specifikāciju un izstrādi, piemēram, stimulu mehānismu vai uzņēmējdarbības plānu."
                    },
                    "problemprofiles": [
                        "DEF_PROBLEM_3"
                    ],
                    "prerequisites": [
                        {
                            "item": "task-collaborative-re-design-of-solution-functionalities",
                            "type": "previous"
                        }
                    ],
                    "id": "task-co-design-of-co-delivery-mechanisms-incentives"
                },
                {
                    "name_translations": {
                        "en": "Collaborative re-design of monitoring mechanisms",
                        "es": "Rediseño colaborativo de los mecanismos de control",
                        "it": "Riprogettazione collaborativa dei meccanismi di monitoraggio",
                        "lv": "Uzraudzības mehānismu kopīga pārprojektēšana"
                    },
                    "description_translations": {
                        "en": "Tackle the specification and re-design of monitoring mechanisms of the solution, e.g. logging system.",
                        "es": "Abordar la especificación y el rediseño de los mecanismos de supervisión de la solución, por ejemplo, el sistema de registro.",
                        "it": "Affrontare la specifica e la riprogettazione dei meccanismi di monitoraggio della soluzione, ad esempio il sistema di registrazione.",
                        "lv": "Risinājuma uzraudzības mehānismu, piemēram, reģistrēšanas sistēmas, specifikācija un pārprojektēšana."
                    },
                    "problemprofiles": [
                        "DEF_PROBLEM_3"
                    ],
                    "prerequisites": [
                        {
                            "item": "task-co-design-of-co-delivery-mechanisms-incentives",
                            "type": "previous"
                        }
                    ],
                    "id": "task-collaborative-re-design-of-monitoring-mechanisms"
                }
            ],
            "prerequisites": [
                {
                    "item": "objective-co-decide-future-co-design-actions",
                    "type": "previous"
                }
            ],
            "id": "objective-repeat-co-design-process-based-on-features-co-decided"
        }
    ],
    "is_part_of_codelivery": false
}